---
kind: property
id: P:Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings.IsValidObject
source: html/16bf3832-2ee8-a145-a082-67e0e2e5e908.htm
---
# Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.